Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/include/pic32ck2051gc00144.h
#define FLASH_CFM_USERCFG1_SIZE        _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FLASH_CFM_USERCFG1_PAGE_SIZE   _UINT32_(      4096)
#define FLASH_CFM_USERCFG1_NB_OF_PAGES _UINT32_(         1)

#define FLASH_CFM_USEROTP1_SIZE        _UINT32_(0x00001000)    /*    4kB Memory segment type: user_signatures */
#define FLASH_CFM_USEROTP1_PAGE_SIZE   _UINT32_(      4096)
#define FLASH_CFM_USEROTP1_NB_OF_PAGES _UINT32_(         1)

#define FLASH_CFM_BOOTCFG1_SIZE        _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FLASH_CFM_BOOTCFG1_PAGE_SIZE   _UINT32_(      4096)
#define FLASH_CFM_BOOTCFG1_NB_OF_PAGES _UINT32_(         1)

#define FLASH_CFM_DALCFG_SIZE          _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FLASH_CFM_DALCFG_PAGE_SIZE     _UINT32_(      4096)
#define FLASH_CFM_DALCFG_NB_OF_PAGES   _UINT32_(         1)

#define FLASH_CFM_CALBACKUP_SIZE       _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FLASH_CFM_CALBACKUP_PAGE_SIZE  _UINT32_(      4096)
#define FLASH_CFM_CALBACKUP_NB_OF_PAGES _UINT32_(         1)

#define FLASH_CFM_CALOTP_SIZE          _UINT32_(0x00001000)    /*    4kB Memory segment type: other */
#define FLASH_CFM_CALOTP_PAGE_SIZE     _UINT32_(      4096)
#define FLASH_CFM_CALOTP_NB_OF_PAGES   _UINT32_(         1)

#define FLASH_CFM_USERCFG2_SIZE        _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FLASH_CFM_USERCFG2_PAGE_SIZE   _UINT32_(      4096)
#define FLASH_CFM_USERCFG2_NB_OF_PAGES _UINT32_(         1)

#define FLASH_CFM_USEROTP2_SIZE        _UINT32_(0x00001000)    /*    4kB Memory segment type: user_signatures */
#define FLASH_CFM_USEROTP2_PAGE_SIZE   _UINT32_(      4096)
#define FLASH_CFM_USEROTP2_NB_OF_PAGES _UINT32_(         1)

#define FLASH_CFM_BOOTCFG2_SIZE        _UINT32_(0x00001000)    /*    4kB Memory segment type: flash */
#define FLASH_CFM_BOOTCFG2_PAGE_SIZE   _UINT32_(      4096)
#define FLASH_CFM_BOOTCFG2_NB_OF_PAGES _UINT32_(         1)

#define FLASH_PFM_SIZE                 _UINT32_(0x00200000)    /* 2048kB Memory segment type: flash */
#define FLASH_PFM_PAGE_SIZE            _UINT32_(      4096)
#define FLASH_PFM_NB_OF_PAGES          _UINT32_(       512)

#define SQI_SFR_SIZE                   _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define SQI_XIP_SIZE                   _UINT32_(0x10000000)    /* 262144kB Memory segment type: ram */
#define HSRAM_RET_SIZE                 _UINT32_(0x00080000)    /*  512kB Memory segment type: ram */
#define HPB0_BRIDGE_SIZE               _UINT32_(0x00030000)    /*  192kB Memory segment type: io */
#define HPB1_BRIDGE_SIZE               _UINT32_(0x00030000)    /*  192kB Memory segment type: io */
#define HPB2_BRIDGE_SIZE               _UINT32_(0x00030000)    /*  192kB Memory segment type: io */
#define USBHS_SFR_SIZE                 _UINT32_(0x00001600)    /*    5kB Memory segment type: io */
#define EBI_CS0_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: ram */
#define EBI_CS1_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: ram */
#define EBI_CS2_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: ram */
#define EBI_CS3_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: ram */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */

#define CMCC_DATARAM_ADDR              _UINT32_(0x00000000)    /* CMCC_DATARAM base address (type: ram)*/
#define CMCC_TAGRAM_ADDR               _UINT32_(0x00001000)    /* CMCC_TAGRAM base address (type: ram)*/
#define CMCC_VALIDRAM_ADDR             _UINT32_(0x00003000)    /* CMCC_VALIDRAM base address (type: ram)*/
#define PRM_ROM_ADDR                   _UINT32_(0x04000000)    /* PRM_ROM base address (type: rom)*/
#define FLASH_BFM_ADDR                 _UINT32_(0x08000000)    /* FLASH_BFM base address (type: flash)*/
#define FLASH_CFM_USERCFG1_ADDR        _UINT32_(0x0a000000)    /* FLASH_CFM_USERCFG1 base address (type: flash)*/
#define FLASH_CFM_USEROTP1_ADDR        _UINT32_(0x0a001000)    /* FLASH_CFM_USEROTP1 base address (type: user_signatures)*/
#define FLASH_CFM_BOOTCFG1_ADDR        _UINT32_(0x0a002000)    /* FLASH_CFM_BOOTCFG1 base address (type: flash)*/
#define FLASH_CFM_DALCFG_ADDR          _UINT32_(0x0a004000)    /* FLASH_CFM_DALCFG base address (type: flash)*/
#define FLASH_CFM_CALBACKUP_ADDR       _UINT32_(0x0a006000)    /* FLASH_CFM_CALBACKUP base address (type: flash)*/
#define FLASH_CFM_CALOTP_ADDR          _UINT32_(0x0a007000)    /* FLASH_CFM_CALOTP base address (type: other)*/
#define FLASH_CFM_USERCFG2_ADDR        _UINT32_(0x0a008000)    /* FLASH_CFM_USERCFG2 base address (type: flash)*/
#define FLASH_CFM_USEROTP2_ADDR        _UINT32_(0x0a009000)    /* FLASH_CFM_USEROTP2 base address (type: user_signatures)*/
#define FLASH_CFM_BOOTCFG2_ADDR        _UINT32_(0x0a00a000)    /* FLASH_CFM_BOOTCFG2 base address (type: flash)*/
#define FLASH_PFM_ADDR                 _UINT32_(0x0c000000)    /* FLASH_PFM base address (type: flash)*/
#define SQI_SFR_ADDR                   _UINT32_(0x0ffff000)    /* SQI_SFR base address (type: io)*/
#define SQI_XIP_ADDR                   _UINT32_(0x10000000)    /* SQI_XIP base address (type: ram)*/
#define HSRAM_RET_ADDR                 _UINT32_(0x20000000)    /* HSRAM_RET base address (type: ram)*/
#define HPB0_BRIDGE_ADDR               _UINT32_(0x44000000)    /* HPB0_BRIDGE base address (type: io)*/
#define HPB1_BRIDGE_ADDR               _UINT32_(0x44800000)    /* HPB1_BRIDGE base address (type: io)*/
#define HPB2_BRIDGE_ADDR               _UINT32_(0x45000000)    /* HPB2_BRIDGE base address (type: io)*/
#define USBHS_SFR_ADDR                 _UINT32_(0x46000000)    /* USBHS_SFR base address (type: io)*/
#define EBI_CS0_ADDR                   _UINT32_(0x60000000)    /* EBI_CS0 base address (type: ram)*/
#define EBI_CS1_ADDR                   _UINT32_(0x61000000)    /* EBI_CS1 base address (type: ram)*/
#define EBI_CS2_ADDR                   _UINT32_(0x62000000)    /* EBI_CS2 base address (type: ram)*/
#define EBI_CS3_ADDR                   _UINT32_(0x63000000)    /* EBI_CS3 base address (type: ram)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CK2051GC00144                                 */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X09509053)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CK2051GC00144                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for C32CK2051GC00144 */
/* ************************************************************************** */
#define EVENT_ID_GEN_SUPC_LVDET                           1 /* ID for SUPC event generator LVDET */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL                    2 /* ID for OSCCTRL event generator XOSC_FAIL */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32K_FAIL              3 /* ID for OSC32KCTRL event generator XOSC32K_FAIL */
#define EVENT_ID_GEN_FREQM_DONE                           4 /* ID for FREQM event generator DONE */
#define EVENT_ID_GEN_FREQM_WINMON                         5 /* ID for FREQM event generator WINMON */
#define EVENT_ID_GEN_RTC_PER_0                            6 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            7 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            8 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            9 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                           10 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                           11 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           12 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           13 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_RTC_PERD                            14 /* ID for RTC event generator PERD */
#define EVENT_ID_GEN_RTC_CMP_0                           15 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                           16 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_CMP_2                           17 /* ID for RTC event generator CMP_2 */
#define EVENT_ID_GEN_RTC_CMP_3                           18 /* ID for RTC event generator CMP_3 */
#define EVENT_ID_GEN_RTC_TAMPER                          19 /* ID for RTC event generator TAMPER */
#define EVENT_ID_GEN_RTC_OVF                             20 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_EIC_EXTINT_0                        21 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        22 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        23 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        24 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        25 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        26 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        27 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        28 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        29 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        30 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       31 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       32 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       33 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       34 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       35 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       36 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_PAC_ACCERR                          37 /* ID for PAC event generator ACCERR */
#define EVENT_ID_GEN_DMA0_CH_0                           38 /* ID for DMA0 event generator CH_0 */
#define EVENT_ID_GEN_DMA0_CH_1                           39 /* ID for DMA0 event generator CH_1 */
#define EVENT_ID_GEN_DMA0_CH_2                           40 /* ID for DMA0 event generator CH_2 */
#define EVENT_ID_GEN_DMA0_CH_3                           41 /* ID for DMA0 event generator CH_3 */
#define EVENT_ID_GEN_DMA0_CH_4                           42 /* ID for DMA0 event generator CH_4 */
#define EVENT_ID_GEN_DMA0_CH_5                           43 /* ID for DMA0 event generator CH_5 */
#define EVENT_ID_GEN_DMA0_CH_6                           44 /* ID for DMA0 event generator CH_6 */
#define EVENT_ID_GEN_DMA0_CH_7                           45 /* ID for DMA0 event generator CH_7 */
#define EVENT_ID_GEN_DMA1_CH_0                           46 /* ID for DMA1 event generator CH_0 */
#define EVENT_ID_GEN_DMA1_CH_1                           47 /* ID for DMA1 event generator CH_1 */
#define EVENT_ID_GEN_DMA1_CH_2                           48 /* ID for DMA1 event generator CH_2 */
#define EVENT_ID_GEN_DMA1_CH_3                           49 /* ID for DMA1 event generator CH_3 */
#define EVENT_ID_GEN_TCC0_OVF                            50 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            51 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            52 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           53 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           54 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           55 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           56 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC0_MC_4                           57 /* ID for TCC0 event generator MC_4 */
#define EVENT_ID_GEN_TCC0_MC_5                           58 /* ID for TCC0 event generator MC_5 */
#define EVENT_ID_GEN_TCC1_OVF                            59 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            60 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            61 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC_0                           62 /* ID for TCC1 event generator MC_0 */
#define EVENT_ID_GEN_TCC1_MC_1                           63 /* ID for TCC1 event generator MC_1 */
#define EVENT_ID_GEN_TCC1_MC_2                           64 /* ID for TCC1 event generator MC_2 */
#define EVENT_ID_GEN_TCC1_MC_3                           65 /* ID for TCC1 event generator MC_3 */
#define EVENT_ID_GEN_TCC1_MC_4                           66 /* ID for TCC1 event generator MC_4 */
#define EVENT_ID_GEN_TCC1_MC_5                           67 /* ID for TCC1 event generator MC_5 */
#define EVENT_ID_GEN_TCC2_OVF                            68 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            69 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            70 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC_0                           71 /* ID for TCC2 event generator MC_0 */
#define EVENT_ID_GEN_TCC2_MC_1                           72 /* ID for TCC2 event generator MC_1 */
#define EVENT_ID_GEN_TCC2_MC_2                           73 /* ID for TCC2 event generator MC_2 */
#define EVENT_ID_GEN_TCC2_MC_3                           74 /* ID for TCC2 event generator MC_3 */
#define EVENT_ID_GEN_TCC2_MC_4                           75 /* ID for TCC2 event generator MC_4 */
#define EVENT_ID_GEN_TCC2_MC_5                           76 /* ID for TCC2 event generator MC_5 */
#define EVENT_ID_GEN_TCC3_OVF                            77 /* ID for TCC3 event generator OVF */
#define EVENT_ID_GEN_TCC3_TRG                            78 /* ID for TCC3 event generator TRG */
#define EVENT_ID_GEN_TCC3_CNT                            79 /* ID for TCC3 event generator CNT */
#define EVENT_ID_GEN_TCC3_MC_0                           80 /* ID for TCC3 event generator MC_0 */
#define EVENT_ID_GEN_TCC3_MC_1                           81 /* ID for TCC3 event generator MC_1 */
#define EVENT_ID_GEN_TCC3_MC_2                           82 /* ID for TCC3 event generator MC_2 */
#define EVENT_ID_GEN_TCC3_MC_3                           83 /* ID for TCC3 event generator MC_3 */
#define EVENT_ID_GEN_TCC3_MC_4                           84 /* ID for TCC3 event generator MC_4 */
#define EVENT_ID_GEN_TCC3_MC_5                           85 /* ID for TCC3 event generator MC_5 */
#define EVENT_ID_GEN_TCC4_OVF                            86 /* ID for TCC4 event generator OVF */
#define EVENT_ID_GEN_TCC4_TRG                            87 /* ID for TCC4 event generator TRG */
#define EVENT_ID_GEN_TCC4_CNT                            88 /* ID for TCC4 event generator CNT */
#define EVENT_ID_GEN_TCC4_MC_0                           89 /* ID for TCC4 event generator MC_0 */
#define EVENT_ID_GEN_TCC4_MC_1                           90 /* ID for TCC4 event generator MC_1 */
#define EVENT_ID_GEN_TCC5_OVF                            91 /* ID for TCC5 event generator OVF */
#define EVENT_ID_GEN_TCC5_TRG                            92 /* ID for TCC5 event generator TRG */
#define EVENT_ID_GEN_TCC5_CNT                            93 /* ID for TCC5 event generator CNT */
#define EVENT_ID_GEN_TCC5_MC_0                           94 /* ID for TCC5 event generator MC_0 */
#define EVENT_ID_GEN_TCC5_MC_1                           95 /* ID for TCC5 event generator MC_1 */
#define EVENT_ID_GEN_TCC6_OVF                            96 /* ID for TCC6 event generator OVF */
#define EVENT_ID_GEN_TCC6_TRG                            97 /* ID for TCC6 event generator TRG */
#define EVENT_ID_GEN_TCC6_CNT                            98 /* ID for TCC6 event generator CNT */
#define EVENT_ID_GEN_TCC6_MC_0                           99 /* ID for TCC6 event generator MC_0 */
#define EVENT_ID_GEN_TCC6_MC_1                          100 /* ID for TCC6 event generator MC_1 */
#define EVENT_ID_GEN_TCC7_OVF                           101 /* ID for TCC7 event generator OVF */
#define EVENT_ID_GEN_TCC7_TRG                           102 /* ID for TCC7 event generator TRG */
#define EVENT_ID_GEN_TCC7_CNT                           103 /* ID for TCC7 event generator CNT */
#define EVENT_ID_GEN_TCC7_MC_0                          104 /* ID for TCC7 event generator MC_0 */
#define EVENT_ID_GEN_TCC7_MC_1                          105 /* ID for TCC7 event generator MC_1 */
#define EVENT_ID_GEN_ADC_CHRDYC_0                       106 /* ID for ADC event generator CHRDYC_0 */
#define EVENT_ID_GEN_ADC_CMP_0                          107 /* ID for ADC event generator CMP_0 */
#define EVENT_ID_GEN_AC_COMP_0                          108 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                          109 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                           110 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_SPI_IXS_GEN                        113 /* ID for SPI event generator IXS_GEN */
#define EVENT_ID_GEN_CCL_LUTOUT_0                       114 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                       115 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_CCL_LUTOUT_2                       116 /* ID for CCL event generator LUTOUT_2 */
#define EVENT_ID_GEN_CCL_LUTOUT_3                       117 /* ID for CCL event generator LUTOUT_3 */
#define EVENT_ID_GEN_PDEC_DIR                           118 /* ID for PDEC event generator DIR */
#define EVENT_ID_GEN_PDEC_ERR                           119 /* ID for PDEC event generator ERR */
#define EVENT_ID_GEN_PDEC_MC_0                          120 /* ID for PDEC event generator MC_0 */
#define EVENT_ID_GEN_PDEC_MC_1                          121 /* ID for PDEC event generator MC_1 */
#define EVENT_ID_GEN_PDEC_OVF                           122 /* ID for PDEC event generator OVF */
#define EVENT_ID_GEN_PDEC_VLC                           123 /* ID for PDEC event generator VLC */
#define EVENT_ID_GEN_TRNG_READY                         125 /* ID for TRNG event generator READY */

